#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидДоговораПриИзмененииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВидДоговораПриИзмененииНаСервере(Форма)
	
	Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Форма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		Форма.Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Форма.Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Форма.Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		
	Иначе
		Форма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		Форма.Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Форма.Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Форма.Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидДоговораПриИзмененииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
